static void GenerateClients(int numberOfClients)
{
    string[] maleName =
        "Володимир,Микола,Олександр,Iван,Василь,Сергiй,Андрiй,Дмитро,Максим,Вiктор,Степан,Анатолiй,Михайло,Петро,Назар,Артем,Владислав,Марко,Юрiй,Олексiй,Григорiй,Вiталiй,Iгор,Олег,Валерiй,Павло,Роман,Матвiй,Данило,Денис,Ярослав,Мирослав,Любомир,Бронiслав,Тарас,Святослав,Вартан,Мурат,Костянтин"
            .Split(",");
    string[] femaleName =
        "Аврора,Меланiя,Матильда,Анна,Ганна,Марiя,Софiя,Олена,Iрина,Свiтлана,Тетяна,Наталiя,Вiкторiя,Соломiя,Анастасiя,Вiра,Христина,Надiя,Дарина,Ольга,Катерина,Лiдiя,Оксана,Ксенiя,Олександра,Веронiка,Яна,Марта,Юлiя,Людмила,Нiна,Валентина,Ярослава,Дiана,Єремiя,Варвара,Любов,Мiла,Анна-Марiя,Галина,Леся,Етель,Аделiна,Вiталiна,Мирослава,Бронiслава,Станiслава"
            .Split(",");
    string[] surname =
        "Головачко,Лукачко,Скачко,Харачко,Шостачко,Василечко,Гречко,Дядечко,Михалечко,Юречко,Андрiєчко,Боєчко,Меєчко,Мосiєчко,Сергiєчко,Бичко,Величко,Кличко,Музичко,Павличко,Маловiчко,Мрiчко,Пасiчко,Попiчко,Рябiчко,Сiчко,Боїчко,Вуїчко,Заїчко,Яїчко,Iваночко,Леочко,Марочко,Семочко,Толочко,Безручко,Онучко,Сухоручко,Фучко,Хандучко,Гадючко,Каючко,Ключко,Костючко,Минючко,Болячко,Крячко,Маячко,Пиячко,Сiм'ячко,Андрухович,Анкудович,Давидович,Денькович,Карпович,Корiатович,Коцюбович,Лазарович,Попович,Сахнович,Сенатович,Станкович,Суранович,Гриневич,Козакевич,Маркевич,Матусевич,Нарушевич,Сакевич,Сташкевич,Тобiлевич,Чуревич,Шухевич,Юркевич,Андрiєвич,Гордiєвич,Загаєвич,Зуєвич,Iсаєвич,Кулiєвич,Мацiєвич,Огiєвич,Саєвич,Тонiєвич,Шеремереєвич,Гнатисько,Iванисько,Ковалисько,Крисько,Лисько,Мисько,Олисько,Онисько,Павлисько,Петрiсько,Савiсько,Самiсько,Андрiєнюк,Бережнюк,Вознюк,Голоднюк,Городнюк,Завальнюк,Загороднюк,Ковбаснюк,Крайнюк,Кузьменюк,Максименюк,Науменюк,Омельнук,Очеретнюк,Пасiчнюк,Плахотнюк,Погребнюк,Попельнюк,Присяжнюк,Сахнюк,Смицнюк,Срiбнюк,Тельнюк,Ямнюк"
            .Split(",");
    string[] operators = { "+38050", "+38095", "+38063", "+38067", "+38068", "+38067", "+38066", "+38093", "+38095" };
    string[] cities = {"Авдiївка", "Алмазна", "Алупка", "Алушта", "Алчевськ", "Амвросiївка", "Ананьїв", "Андрушiвка", "Антрацит", "Армянськ", "Арциз", "Балаклiя", "Балта", "Бар", "Баранiвка", "Батурин", "Бахмач", "Бахмут", "Бахчисарай", "Баштанка", "Белз", "Бердичiв", "Бердянськ", "Бережани", "Березань", "Березiвка", "Берестечко", "Берислав", "Бершадь", "Бiбрка", "Бiла Церква", "Бiлгород-Днiстровський", "Бiлогiрськ", "Бiлопiлля", "Бiляївка", "Бобринець", "Бобровиця", "Богодухiв", "Богуслав", "Болград", "Болехiв", "Борзна", "Борислав", "Бориспiль", "Борщiв", "Боярка", "Бровари", "Броди", "Брянка", "Буринь", "Бурштин", "Буськ", "Буча", "Бучач", "Валки", "Вараш", "Василiвка", "Василькiв", "Вашкiвцi", "Великi Мости", "Верхньоднiпровськ", "Вижниця", "Винники", "Виноградiв", "Вишгород", "Вiльногiрськ", "Вiльнянськ", "Вiнниця", "Вовчанськ", "Вознесенiвка", "Вознесенськ", "Волноваха", "Володимир", "Волочиськ", "Ворожба", "Вуглегiрськ", "Вугледар", "Гадяч", "Гайворон", "Гайсин", "Галич", "Генiчеськ", "Герца", "Гiрник", "Глиняни", "Глухiв", "Гнiвань", "Гола Пристань", "Голубiвка", "Горiшнi Плавнi", "Горлiвка", "Городенка", "Городня", "Городок", "Городок", "Горохiв", "Гребiнка", "Деражня", "Дергачi", "Джанкой", "Днiпро", "Добромиль", "Добропiлля", "Довжанськ", "Докучаєвськ", "Долина", "Долинська", "Донецьк", "Дрогобич", "Дружба", "Дружкiвка", "Дубляни", "Дубно", "Дубровиця", "Дунаївцi", "Енергодар", "Євпаторiя", "Жашкiв", "Жданiвка", "Жидачiв", "Житомир", "Жмеринка", "Жовква", "Жовтi Води", "Залiщики", "Запорiжжя", "Заставна", "Звягель", "Збараж", "Зборiв", "Звенигородка", "Здолбунiв", "Зеленодольськ", "Зимогiр'я", "Зiнькiв", "Змiїв", "Знам'янка", "Золотоноша", "Золочiв", "Зоринськ", "Зугрес", "Iвано-Франкiвськ", "Iзмаїл", "Iзюм", "Iзяслав", "Iллiнцi", "Iловайськ", "Iнкерман", "Iрмiно", "Iрпiнь", "Iршава", "Iчня", "Кагарлик", "Кадiївка", "Калинiвка", "Калуш", "Камiнь-Каширський", "Кам'янець-Подiльський", "Кам'янка", "Кам'янка-Бузька", "Кам'янка-Днiпровська", "Канiв", "Карлiвка", "Каховка", "Керч", "Київ", "Кiверцi", "Кiлiя", "Кiцмань", "Кобеляки", "Ковель", "Кодима", "Козятин", "Коломия", "Комарно", "Конотоп", "Копичинцi", "Корець", "Коростень", "Коростишiв", "Корсунь-Шевченкiвський", "Корюкiвка", "Kosów COA.png", "Костопiль", "Костянтинiвка", "Краматорськ", "Красилiв", "Красногорiвка", "Красноград", "Красноперекопськ (Яни Капу)", "Кременець", "Кременчук", "Кремiнна", "Кривий Рiг", "Кролевець", "Кропивницький", "Куп'янськ", "Ладижин", "Ланiвцi", "Лебедин", "Лиман", "Липовець", "Лисичанськ", "UKR Лозова́ COA.gif", "Лохвиця", "Лубни", "Луганськ", "Луцьк", "Львiв", "Любомль", "Люботин", "Макiївка", "Мала Виска", "Малин", "Марганець", "Марiуполь", "Мар'їнка", "Мелiтополь", "Мена", "Мерефа", "Миколаїв", "Миколаїв", "Миколаївка", "Миргород", "Мирноград", "Миронiвка", "Мiусинськ", "Могилiв-Подiльський", "Молодогвардiйськ", "Молочанськ", "Монастириська", "Моршин", "Мостиська", "Мукачево", "Надвiрна", "Немирiв", "Нетiшин", "Нiжин", "Нiкополь", "Нова Каховка", "Нова Одеса", "Новгород-Сiверський", "Новий Буг", "Новий Калинiв", "Новий Роздiл", "Новоазовськ", "Нововолинськ", "Новогродiвка", "Новоднiстровськ", "Новодружеськ", "Новомиргород", "Новомосковськ", "Новоселиця", "Новоукраїнка", "Новояворiвськ", "Носiвка", "Обухiв", "Овруч", "Одеса", "Олевськ", "Олександрiвськ", "Олександрiя", "Олешки", "Орiхiв", "Остер", "Острог", "Охтирка", "Очакiв", "Павлоград", "Первомайськ", "Первомайськ", "Первомайський", "Перевальськ", "Перемишляни", "Перечин", "Переяслав", "Першотравенськ", "Петрово-Красносiлля", "Пирятин", "Пiдгайцi", "Подiльськ", "Покров", "Покровськ", "Пологи", "Полтава", "Помiчна", "Попасна", "Почаїв", "Привiлля", "Прилуки", "Приморськ", "Прип'ять", "Пустомити", "Путивль", "П'ятихатки", "Рава-Руська", "Радехiв", "Радивилiв", "Радомишль", "Рахiв", "Ренi", "Решетилiвка", "Ржищiв", "Ровеньки", "Рогатин", "Роздiльна", "Ромни", "Рудки", "Саки", "Самбiр", "Сарни", "Свалява", "Свiтловодськ", "Свiтлодарськ", "Святогiрськ", "Севастополь", "Семенiвка", "Середина-Буда", "Сєвєродонецьк", "Сiверськ", "Сiмферополь", "Скадовськ", "Скалат", "Сквира", "Славута", "Славутич", "Слов'янськ", "Смiла", "Снiгурiвка", "Сновськ", "Снятин", "Сокаль", "Сокиряни", "Соледар", "Соснiвка", "Старий Крим", "Старий Самбiр", "Старобiльськ", "Старокостянтинiв", "Стебник", "Сторожинець", "Стрий", "Судак", "Судова Вишня", "Суми", "Суходiльськ", "Таврiйськ", "Тараща", "Татарбунари", "Теплодар", "Теребовля", "Тернiвка", "Тернопiль", "Тетiїв", "Тисмениця", "Тлумач", "Токмак", "Торецьк", "Тростянець", "Трускавець", "Тульчин", "Турка", "Тячiв", "Угнiв", "Ужгород", "Узин", "Українка", "Українськ", "Умань", "Устилуг", "Фастiв", "Феодосiя", "Харкiв", "Харцизьк", "Херсон", "Хирiв", "Хмельницький", "Хмiльник", "Ходорiв", "Хорол", "Хоросткiв", "Хотин", "Хрестiвка", "Христинiвка", "Хрустальний", "Хуст", "Часiв Яр", "Червоноград", "Черкаси", "Чернiвцi", "Чернiгiв", "Чигирин", "Чоп", "Чорнобиль", "Чорноморськ", "Чорткiв", "Чугуїв", "Чуднiв", "Шаргород", "Шахтарськ", "Шепетiвка", "Шостка", "Шпола", "Шумськ", "Щастя", "Южноукраїнськ", "Яворiв", "Яготин", "Ялта", "Ямпiль", "Ясинувата"};
    string[] streets = {"Авiаторiв", "Агрономiчна", "Альбрехта", "Професора Амалицького", "Андрiївська", "Андрiївський узвiз", "Професора Антоновича", "Археологiчна", "Професора Арциховського", "Аршенєвських", "Багратiонiвська", "Iвана Багряного", "Бальзакiвська", "Степана Бандери", "Христофора Барановського", "Барашiвська", "Басейна", "Безименського", "Велика Бердичiвська", "Мала Бердичiвська", "Березiвська", "Бєльського", "Iвана Бiлика", "Бiлоруська", "Лiкаря Бланка", "Богуна", "Iвана Богуна", "Богунська", "Петра Болбочана", "Болгарська", "Бондарна", "Будинки Офiцерського Складу", "Брасюка", "Бруховського", "Будiвельна", "Будiвельникiв", "Тараса Бульби-Боровця", "Бялика", "Академiка Векслера", "Вересiвський Шлях", "Гетьмана Виговського", "Визволення", "Винниченка", "Вiльський Шлях", "Вiтрука", "Вокзальна", "Володимирська", "Гагарiна", "Гайдамацька", "Гаражна", "Героїв Базару", "Героїв Крут", "Героїв Пожежних", "Героїв Чорнобиля", "Глибочицька", "Гоголiвська", "Iвана Гонти", "Гончарна", "Гранiтна", "Дачна", "Академiка Дашкевича", "Декабристiв", "Денишiвська", "Вацлава Длоуги", "Дмитрiвська", "Добровольчих батальйонiв", "Довженка", "Домбровського", "Дружби", "Житнiй Базар", "Житнiй Ринок", "Жуйка", "Mайора Заброцького", "Заводська", "Закам'янська", "Залiзнична", "Зарембського", "Зарiчна", "Захiдна", "Зв'язкiвцiв", "Звягельська", "Згоди", "Зелена", "Зелена", "Зелена", "Зоряна", "Святого Йоана Павла II", "Калинова", "Петра Калнишевського", "Кам'янська", "Кам'янська", "Каракульна", "Кармелюка", "Кафедральна", "Каховська", "Леха Качинського", "Кибальчича", "Київська", "Кiльцева", "Князiв Острозьких", "Козацька", "Комерцiйна", "Євгена Коновальця", "Євгена Концевича", "Кооперативна", "Корабельна", "Короленка", "Короленка", "Корольова", "Iм. С. П. Корольова", "Космонавтiв", "Костьольна", "Коцюбинського", "Професора Кравченка", "Кривий Брiд", "Крошенська", "Крошенська", "Купальна" };

    string[] clients = new string[numberOfClients];
    Random random = new Random();
    for (int i = 0; i < numberOfClients; i++)
    {
        int sex = random.Next(2);
        string name = sex == 0
            ? maleName[random.Next(maleName.Length)]
            : femaleName[random.Next(femaleName.Length)];
        string end = sex == 0 ? "ович" : "iвна";
        string patronymic = maleName[random.Next(maleName.Length)];
        if (patronymic[^1] is 'ь' or 'о') patronymic = patronymic.Remove(patronymic.Length - 1);
        if (patronymic[^1] == 'а') patronymic += 'й';
        patronymic += end;
        patronymic = patronymic.Replace("йi", "ї");
        string phoneNum = operators[random.Next(operators.Length)];
        for (int j = 0; j < 7; j++)
        {
            phoneNum += random.Next(10);
        }
        clients[i] = $"{i+2},{surname[random.Next(surname.Length)]},{name},{patronymic},\"м. {cities[random.Next(cities.Length)]}, вул. {streets[random.Next(streets.Length)]}, {random.Next(1, 215)}\",{phoneNum}";
    }

    StreamWriter sw = new StreamWriter("C:/Users/youn1on/Desktop/Labs/3_semester/DB/Lab2/clients.csv");
    foreach (string client in clients)
    {
        sw.WriteLine(client);
    }
    sw.Close();
}

static void GenerateChecks(int amountOfClients)
{
    int ctr = 1;
    StreamWriter sw = new StreamWriter("C:/Users/youn1on/Desktop/Labs/3_semester/DB/Lab2/checks.csv", false);
    Random random = new Random();

    for (int client = 1; client <= amountOfClients; client++)
    {
        int n = random.Next(1, 6);
        for (int check = 0; check < n; check++)
        {
            sw.WriteLine($"{ctr++},20{random.Next(18, 23)}-{random.Next(1, 13)}-{random.Next(1, 29)} {random.Next(8, 18)}:{random.Next(60)}:{random.Next(60)},0,{client}",0);
        }
    }

    sw.Close();
    
    GenerateTours(ctr-1);
}

static void GenerateRooms(int amountOfHotels)
{
    string[] types = { "Standard", "Deluxe", "Connecting", "Suite", "Apartment-style" };
    short[] prices = { 30, 50, 30, 70, 100};
    StreamWriter sw = new StreamWriter("C:/Users/youn1on/Desktop/Labs/3_semester/DB/Lab2/rooms.csv", false);
    Random random = new Random();

    for (int hotel = 1; hotel <= amountOfHotels; hotel++)
    {
        int n = random.Next(15, 201);
        double pricePolitics = 1 + random.NextDouble();
        for (int room = 0; room < n; room++)
        {
            int type = random.Next(types.Length);
            int places = type == 2 ? random.Next(2, 7) : random.Next(1, 5);
            int price = (int)(prices[type] * places * pricePolitics);
            sw.WriteLine($"{hotel},{room+1},{price/10*10},{types[type]},{places}");
        }
    }

    sw.Close();
}


static void GenerateTours(int amountOfChecks)
{
    StreamWriter sw = new StreamWriter("C:/Users/youn1on/Desktop/Labs/3_semester/DB/Lab2/tours.sql", false);
    Random random = new Random();
    string prefix =
        "insert into package_tour(check_id, hotel_id, date_of_departure, return_date, number_of_people) VALUE (";
    for (int check = 1; check <= amountOfChecks; check++)
    {
        int n = random.Next(1, 4);
        for (int tour = 0; tour < n; tour++)
        {
            int hotel = random.Next(1, 21);
            int numberOfPeople = 50/random.Next(1, 30);
            int year = 2023;
            int month = random.Next(1, 13);
            int day = random.Next(1, 29);
            int hour = random.Next(24);
            int minutes = random.Next(6) * 10;
            int duration = random.Next(2, 22);

            int returnDay = day + duration;
            int returnMonth = month;
            int returnYear = year;
            if (returnDay > 28)
            {
                returnMonth++;
                returnDay -=28;
            }

            if (returnMonth > 12)
            {
                returnYear++;
                returnMonth = 1;
            }

            int returnHour = random.Next(24);
            sw.WriteLine(prefix+$"{check},{hotel},'{year}-{month}-{day} {hour}:{minutes}:00','{returnYear}-{returnMonth}-{returnDay} {returnHour}:00:00',{numberOfPeople});");
        }
    }

    sw.Close();
}

//GenerateRooms(20);
GenerateChecks(151);


